Revit 2027 API
AlignmentStationLabel.IsValidType Method
 Checks if the type is a valid alignment station label type.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidType(
	Element type
)
Public Shared Function IsValidType (
	type As Element
) As Boolean
public:
static bool IsValidType(
	Element^ type
)
static member IsValidType :
        type : Element -> bool
Parameters
type Element
The element type to validate.
Return Value
Boolean
Remarks
 Can be used for finding or types to be set to TypeId when creating alignment label sets with Create(Alignment, View, AlignmentStationLabelOptions); or types to be set to TypeId when creating alignment labels with CreateSet(Alignment, View, AlignmentStationLabelSetOptions).
See Also
Reference
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace